# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement 
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### e_commerce Schema:

![e_commerce%20_schema.png](attachment:e_commerce%20_schema.png)

### Load Required Libraries

In [3]:
## Load required libraies
import mysql.connector
import pandas as pd

### Connect to DB using Mysql-connector-python package

In [4]:
# connecting to Mysql server
import mysql.connector

connection = mysql.connector.connect(host="localhost",
                                    user = "root",
                                    passwd = "Appa@mysql9")
print(connection)

## closing the connection
connection.close()

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000016A3BCED790>

### You are required to create a database named 'e_commerce'

In [9]:
# CREATING 'e_commerce1' DATABASE
# connecting to Mysql sever
connection = mysql.connector.connect(host="localhost",
                                    user="root",
                                    passwd="Appa@mysql9")

# creating a cursor object
cursorObject = connection.cursor()

# creating database
cursorObject.execute("CREATE DATABASE e_commerce1")

## closing the connection after creating a database('ecommerce')
connection.close()

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [10]:
# CREATING TABLES IN 'e_commerce1' DATABASE
# connecting to Mysql sever
connection = mysql.connector.connect(host="localhost",
                                    user="root",
                                    passwd="Appa@mysql9",
                                    database = "e_commerce1")

# creating a cursor object
cursorObject = connection.cursor()

# creating 'supplier' table:
supplier =   """CREATE TABLE supplier(
                SUPP_ID INT PRIMARY KEY,
                SUPP_NAME VARCHAR(50),
                SUPP_CITY VARCHAR(50),
                SUPP_PHONE VARCHAR(50)
                )"""

cursorObject.execute(supplier)

In [11]:
# creating 'customer' table

customer = """CREATE TABLE customer(
              CUS_ID INT PRIMARY KEY NOT NULL,
              CUS_NAME VARCHAR(20) NULL DEFAULT NULL,
              CUS_PHONE VARCHAR(10),
              CUS_CITY VARCHAR(30),
              CUS_GENDER CHAR
              )"""

cursorObject.execute(customer)

In [12]:
# creating 'category' table

category = """CREATE TABLE category(
              CAT_ID INT PRIMARY KEY NOT NULL,
              CAT_NAME VARCHAR(20) NULL DEFAULT NULL
              )"""

cursorObject.execute(category)

In [13]:
# creating 'product' table

product = """CREATE TABLE product(
            PRO_ID INT PRIMARY KEY NOT NULL,
            PRO_NAME VARCHAR(20) NULL DEFAULT NULL,
            PRO_DESC VARCHAR(60) NULL DEFAULT NULL,
            CAT_ID INT NOT NULL,
            FOREIGN KEY (CAT_ID) REFERENCES category(CAT_ID)
            )"""

cursorObject.execute(product)

In [14]:
# creating 'product_details' table

product_details = """CREATE TABLE product_details(
                     PROD_ID INT PRIMARY KEY NOT NULL,
                     PRO_ID INT NOT NULL,
                     SUPP_ID INT NOT NULL,
                     PROD_PRICE INT NOT NULL,
                     FOREIGN KEY (PRO_ID) REFERENCES product(PRO_ID),
                     FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID)
                     )"""

cursorObject.execute(product_details)

In [15]:
# creating 'orders' table

orders = """CREATE TABLE orders(
            ORD_ID INT PRIMARY KEY NOT NULL,
            ORD_AMOUNT INT NOT NULL,
            ORD_DATE DATE,
            CUS_ID INT NOT NULL,
            PROD_ID INT NOT NULL,
            FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID),
            FOREIGN KEY (PROD_ID) REFERENCES product_details(PROD_ID)
            )"""

cursorObject.execute(orders)

In [16]:
# creating 'rating' table

rating = """CREATE TABLE rating(
            RAT_ID INT PRIMARY KEY NOT NULL,
            CUS_ID INT NOT NULL,
            SUPP_ID INT NOT NULL,
            RAT_RATSTARS INT NOT NULL,
            FOREIGN KEY (SUPP_ID) REFERENCES supplier (SUPP_ID),
            FOREIGN KEY (CUS_ID) REFERENCES customer (CUS_ID)
            )"""

cursorObject.execute(rating)
connection.close()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- | 
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 | 
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [17]:
# connecting to Mysql sever
connection = mysql.connector.connect(host="localhost",
                                    user="root",
                                    passwd="Appa@mysql9",
                                    database = "e_commerce1")

# creating a cursor object
cursorObject = connection.cursor()

# insert into "supplier" table

insert_query = "INSERT INTO supplier(SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES (%s, %s, %s, %s)"
val = [(1, "Rajesh Retails", "Delhi", 1234567890 ),
       (2, "Appario Ltd.", "Mumbai", 258963147032),
       (3, "Knome products", "Bangalore", 9785462315),
       (4, "Bansal Retails", "Kochi", 8975463285),
       (5, "Mittal Ltd.", "Lucknow", 7898456532)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [18]:
# insert into "customer" table

insert_query = "INSERT INTO customer(CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER) VALUES (%s, %s, %s, %s, %s)"
val = [(1, "AAKASH", 9999999999, "DELHI", "M"),
        (2, "AMAN", 9785463215, "NOIDA", "M"),
        (3, "NEHA", 9999999998, "MUMBAI", "F"),
        (4, "MEGHA", 9994562399, "KOLKATA", "F"),
        (5, "PULKIT", 7895999999, "LUCKNOW", "M")]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  category
| CAT_ID | CAT_NAME | 
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES | 
| 4 | ELECTRONICS | 
| 5 | CLOTHES |

In [19]:
# insert into "categoty" table

insert_query = "INSERT INTO category(CAT_ID, CAT_NAME) VALUES (%s, %s)"
val = [(1, "BOOKS"),
       (2, "GAMES"),
       (3, "GROCERIES"),
       (4, "ELECTRONICS"),
       (5, "CLOTHES")]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- | 
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 | 
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [20]:
# insert into "product" table

insert_query = "INSERT INTO product(PRO_ID, PRO_NAME,PRO_DESC,CAT_ID) VALUES (%s, %s, %s, %s)"
val = [(1, "GTA V", "DFJDJFDJFDJFDJFJF", 2),
       (2, "TSHIRT", "DFDFJDFJDKFD", 5),
       (3, "ROG LAPTOP", "DFNTTNTNTERND", 4),
       (4, "OATS", "REURENTBTOTH", 3),
       (5, "HARRY POTTER", "NBEMCTHTJTH", 1)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- | 
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 | 
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [21]:
# insert into "product_details" table

insert_query = "INSERT INTO product_details(PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES (%s, %s, %s, %s)"
val = [(1, 1, 2, 1500),
       (2, 3, 5, 30000),
       (3, 5, 1, 3000),
       (4, 2, 3, 2500),
       (5, 4, 1, 1000)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [22]:
# insert into "orders" table

insert_query = "INSERT INTO orders(ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES (%s, %s, %s, %s, %s)"
val = [(20, 1500, '2021-10-12', 3, 5),
       (25, 30500, '2021-09-16', 5, 2),
       (26, 2000, '2021-10-05', 1, 1),
       (30, 3500, '2021-08-16', 4, 3),
       (50, 2000, '2021-10-06', 2, 1)]

cursorObject.executemany(insert_query, val)
connection.commit()

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- | 
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 | 
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [23]:
# insert into "rating" table

insert_query = "INSERT INTO rating(RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES (%s, %s, %s, %s)"
val = [(1, 2, 2, 4),
       (2, 3, 4, 3),
       (3, 5, 1, 5),
       (4, 1, 3, 2),
       (5, 4, 5, 4)]

cursorObject.executemany(insert_query, val)
connection.commit()

connection.close()

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [24]:
# connecting to Mysql sever
connection = mysql.connector.connect(host="localhost",
                                    user="root",
                                    passwd="Appa@mysql9",
                                    database = "e_commerce1")

# creating a cursor object
cursorObject = connection.cursor()

display_query = """SELECT count(CUS_GENDER) as Total_number_of_customers, 
                   CUS_GENDER FROM
                   (SELECT CUS_GENDER, CUS_NAME FROM customer AS customer_details
                   INNER JOIN
                   (SELECT ORD_ID, CUS_ID FROM orders WHERE ORD_AMOUNT >= 3000) AS order_details
                   ON customer_details.CUS_ID = order_details.CUS_ID
                   GROUP BY customer_details.CUS_ID) AS Tab
                   GROUP BY CUS_GENDER;"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)

## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['Total_number_of_customers', 'CUS_GENDER'])
output_df

(1, 'M')
(1, 'F')

   Total_number_of_customers CUS_GENDER
0                          1          M
1                          1          F

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [25]:
display_query = """SELECT product.PRO_NAME, orders.* FROM orders, product_details, product
                   WHERE orders.CUS_ID=2
                   AND orders.PROD_ID = product_details.PROD_ID
                   AND product_details.PRO_ID = product.PRO_ID;"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)   

##  output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['PRO_NAME','ORD_ID','ORD_AMOUNT', 'ORD_DATE', 'CUS_ID', 'PROD_ID'])
output_df

('GTA V', 50, 2000, datetime.date(2021, 10, 6), 2, 1)

  PRO_NAME  ORD_ID  ORD_AMOUNT    ORD_DATE  CUS_ID  PROD_ID
0    GTA V      50        2000  2021-10-06       2        1

### Q5) Display the Supplier details who can supply more than one product.

In [26]:
display_query = """SELECT SUPPLIER.* FROM supplier 
                   WHERE supplier.SUPP_ID IN 
                   (SELECT SUPP_ID FROM product_details
                   GROUP BY SUPP_ID HAVING COUNT(SUPP_ID)>1)
                   GROUP BY supplier.SUPP_ID;"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)

## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['SUPP_ID', 'SUPP_NAME', 'SUPP_CITY', 'SUPP_PHONE'])
output_df

(1, 'Rajesh Retails', 'Delhi', '1234567890')

   SUPP_ID       SUPP_NAME SUPP_CITY  SUPP_PHONE
0        1  Rajesh Retails     Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [27]:
search_query = """ SELECT CAT_NAME FROM orders 
                   JOIN product ON orders.PROD_ID = product.PRO_ID
                   JOIN category ON product.CAT_ID = category.CAT_ID 
                   WHERE orders.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM orders);"""

cursorObject.execute(search_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CAT_NAME'])
output_df

('BOOKS',)

  CAT_NAME
0    BOOKS

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [28]:
display_query = """SELECT product.PRO_ID, product.PRO_NAME FROM orders
                   INNER JOIN
                   product_details ON product_details.PROD_ID = orders.PROD_ID
                   INNER JOIN
                   product on product.PRO_ID = product_details.PRO_ID
                   WHERE orders.ORD_DATE > "2021-10-05";"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['PRO_ID', 'PRO_NAME'])
output_df

(4, 'OATS')
(1, 'GTA V')

   PRO_ID PRO_NAME
0       4     OATS
1       1    GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [29]:
search_query = """SELECT s.SUPP_ID, s.SUPP_NAME, r.RAT_RATSTARS, c.CUS_NAME 
                  FROM rating r JOIN supplier s ON r.SUPP_ID = s.SUPP_ID
                  JOIN customer c ON r.CUS_ID = c.CUS_ID
                  ORDER BY r.RAT_RATSTARS DESC LIMIT 3;"""

cursorObject.execute(search_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['SUPP_ID', 'SUPP_NAME', 'RAT_RATSTARS', 'CUS_NAME'])
output_df

(1, 'Rajesh Retails', 5, 'PULKIT')
(2, 'Appario Ltd.', 4, 'AMAN')
(5, 'Mittal Ltd.', 4, 'MEGHA')

   SUPP_ID       SUPP_NAME  RAT_RATSTARS CUS_NAME
0        1  Rajesh Retails             5   PULKIT
1        2    Appario Ltd.             4     AMAN
2        5     Mittal Ltd.             4    MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [30]:
display_query = """SELECT customer.CUS_NAME, customer.CUS_GENDER 
                   FROM customer WHERE customer.CUS_NAME LIKE 'A%' 
                   OR customer.CUS_NAME LIKE '%A';"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_NAME', 'CUS_GENDER'])
output_df

('AAKASH', 'M')
('AMAN', 'M')
('NEHA', 'F')
('MEGHA', 'F')

  CUS_NAME CUS_GENDER
0   AAKASH          M
1     AMAN          M
2     NEHA          F
3    MEGHA          F

### Q10) Display the total order amount of the male customers.

In [31]:
display_query = """SELECT SUM(o.ORD_AMOUNT) AS TotalOrderAmount
                   FROM orders o
                   JOIN customer c ON o.CUS_ID = c.CUS_ID
                   WHERE c.CUS_GENDER = 'M'"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['TotalOrderAmount'])
output_df

(Decimal('34500'),)

  TotalOrderAmount
0            34500

### Q11) Display all the Customers left outer join with  the orders

In [32]:
display_query = """SELECT c.CUS_ID, c.CUS_NAME, c.CUS_PHONE, c.CUS_CITY, c.CUS_GENDER, 
                   o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE, o.PROD_ID 
                   FROM customer c
                   LEFT JOIN orders o ON c.CUS_ID = o.CUS_ID;"""

cursorObject.execute(display_query)
   
output = cursorObject.fetchall()
   
for x in output:
    print(x)
    
## output in pandas DataFrame 
output_df = pd.DataFrame(output, columns=['CUS_ID', 'CUS_NAME', 'CUS_PHONE', 'CUS_CITY', 'CUS_GENDER', 'ORD_ID', 'ORD_AMOUNT', 'ORD_DATE', 'PROD_ID'])
output_df

(1, 'AAKASH', '9999999999', 'DELHI', 'M', 26, 2000, datetime.date(2021, 10, 5), 1)
(2, 'AMAN', '9785463215', 'NOIDA', 'M', 50, 2000, datetime.date(2021, 10, 6), 1)
(3, 'NEHA', '9999999998', 'MUMBAI', 'F', 20, 1500, datetime.date(2021, 10, 12), 5)
(4, 'MEGHA', '9994562399', 'KOLKATA', 'F', 30, 3500, datetime.date(2021, 8, 16), 3)
(5, 'PULKIT', '7895999999', 'LUCKNOW', 'M', 25, 30500, datetime.date(2021, 9, 16), 2)

,CUS_ID,CUS_NAME,CUS_PHONE,CUS_CITY,CUS_GENDER,ORD_ID,ORD_AMOUNT,ORD_DATE,PROD_ID
0,1,AAKASH,9999999999,DELHI,M,26,2000,2021-10-05,1
1,2,AMAN,9785463215,NOIDA,M,50,2000,2021-10-06,1
2,3,NEHA,9999999998,MUMBAI,F,20,1500,2021-10-12,5
3,4,MEGHA,9994562399,KOLKATA,F,30,3500,2021-08-16,3
4,5,PULKIT,7895999999,LUCKNOW,M,25,30500,2021-09-16,2

In [33]:
# closing the connection after performing database opertions on hr schema
connection.close()

**NOTE:** Always close an open connection once you are done with the database operations

## Happy Learning:)